ETL/Catalogs/ЕдиныйФорматДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ЕдиныйФорматДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидТаблицы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТаблицSQL</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВременнаяТаблица</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВременнаяТаблица</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьТаблицаИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяТаблица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиныйФорматДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пояснение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьРегистратор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗаполнятьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураТаблицыSQL</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоляSQL</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПоля</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыПолейSQL</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Индекс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Измерение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИтогиИзмерение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИтогиРесурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контроль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтруктураТаблицыSQLДляКопирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоляSQL</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПоля</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыПолейSQL</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/InformationRegisters/ТаблицыДляУдаления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ТаблицыДляУдаления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Копировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТаблицаSQL</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиныйФорматДанных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ETL/Catalogs/ЕдиныйФорматДанных/Ext/ObjectModule.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
   
Процедура ПередЗаписью(Отказ)
	
	Отказ = ЕстьДублиИмен();
	
	Если Отказ Тогда
		Сообщить("Дублирование имен полей. Запись не возможна!");
		Возврат;		
	КонецЕсли;
	
	
	СтрокиБезКлюча = СтруктураТаблицыSQL.НайтиСтроки(Новый Структура("КлючСвязи", 0)); 
	
	Если СтрокиБезКлюча.Количество() > 0 Тогда
		
		ТекущийКод = 0; 
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	*
		                      |ПОМЕСТИТЬ втСтруктураТаблицыSQL
		                      |ИЗ
		                      |	&СтруктураТаблицыSQL КАК Т
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	МАКСИМУМ(втСтруктураТаблицыSQL.КлючСвязи) КАК КлючСвязи
		                      |ИЗ
		                      |	втСтруктураТаблицыSQL КАК втСтруктураТаблицыSQL");
		Запрос.УстановитьПараметр("СтруктураТаблицыSQL", СтруктураТаблицыSQL.Выгрузить());   
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаЗапроса.Следующий() Цикл
			ТекущийКод = ВыборкаЗапроса.КлючСвязи;
		КонецЦикла; 
		
		Для Каждого СтрокаТовары Из СтрокиБезКлюча Цикл
			
			ТекущийКод = ТекущийКод + 1;
			СтрокаТовары["КлючСвязи"] = ТекущийКод;
			
		КонецЦикла;
				
	КонецЕсли;
	
	//++ 06.06.2025 Кибернетика Корыткин Проверка неоходимости реструктуризировать таблицу
	Если Не Отказ И Не ЭтоНовый() И ЕстьИзмененияСтруктуры() Тогда                                   
		
		КУдалению = РегистрыСведений.ТаблицыДляУдаления.СоздатьМенеджерЗаписи();
		КУдалению.ТаблицаSQL = Ссылка;
		КУдалению.Записать();
		
	//++ 13.07.2025 Кибернетика Корыткин Регистрируем для повторной выгрузки только объект из основной таблицы
		Если ЗначениеЗаполнено(ОсновнаяТаблица) Тогда
			Справочники.ЕдиныйФорматДанных.ЗарегистрироватьОбъектыДляПовторнойВыгрузки(ОсновнаяТаблица);
		Иначе
			Справочники.ЕдиныйФорматДанных.ЗарегистрироватьОбъектыДляПовторнойВыгрузки(Ссылка);
		КонецЕсли;
	//-- 13.07.2025	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций  
Функция ЕстьИзмененияСтруктуры()  
	
	Возврат НЕ ОбщегоНазначения.КоллекцииИдентичны(Ссылка.СтруктураТаблицыSQL, СтруктураТаблицыSQL,
	"ИмяПоляSQL, ТипПоля",  ,Истина);
	
КонецФункции 


Функция ЕстьДублиИмен()
	
	Отказ = Ложь;
	//
	//ТЗИмен = ЭтотОбъект.СтруктураТаблицыSQL.Выгрузить(, "ИмяПоля");
	//ТЗИменSQL = ЭтотОбъект.СтруктураТаблицыSQL.Выгрузить(, "ИмяПоляSQL");  
	//ТЗИмен.Свернуть("ИмяПоля");
	//ТЗИменSQL.Свернуть("ИмяПоляSQL");
	//
	//Если СтруктураТаблицыSQL.Количество() <> ТЗИмен.Количество() 
	//	ИЛИ СтруктураТаблицыSQL.Количество() <> ТЗИменSQL.Количество() Тогда
	//	Возврат Истина;
	//Иначе
	//	Возврат Ложь;
	//КонецЕсли;
	
	
	
	КонтрольИмяПоля = Новый Соответствие;
	КонтрольИмяПоляSQL = Новый Соответствие;
	
	Для Каждого СтрокаТЧ Из ЭтотОбъект.СтруктураТаблицыSQL Цикл
		
		Если Не ПустаяСтрока(СтрокаТЧ.ИмяПоля) Тогда
			КлючИмяПоля = Строка(СтрокаТЧ.ИмяПоля);
			Если КонтрольИмяПоля.Получить(КлючИмяПоля) <> Неопределено Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон(
					"Обнаружено дублирование имен в строке %1: значение Имя '%2' уже существует!",
					СтрокаТЧ.НомерСтроки,
					СтрокаТЧ.ИмяПоля);
				Сообщение.Сообщить();
				Отказ = Истина;
			Иначе
				КонтрольИмяПоля.Вставить(КлючИмяПоля, Истина);
			КонецЕсли;
		КонецЕсли;
		
		Если Не ПустаяСтрока(СтрокаТЧ.ИмяПоляSQL) Тогда
			КлючИмяПоляSQL = Строка(СтрокаТЧ.ИмяПоляSQL);
			Если КонтрольИмяПоляSQL.Получить(КлючИмяПоляSQL) <> Неопределено Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон(
					"Обнаружено дублирование имен в строке %1: значение Имя поля SQL '%2' уже существует!",
					СтрокаТЧ.НомерСтроки,
					СтрокаТЧ.ИмяПоляSQL);
				Сообщение.Сообщить();
				Отказ = Истина;
			Иначе
				КонтрольИмяПоляSQL.Вставить(КлючИмяПоляSQL, Истина);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Отказ;
КонецФункции
#КонецОбласти          

#Область Инициализация

#КонецОбласти
